// app/data.ts

export type Product = {
  id: string;
  name: string;
  price: number;
  description: string;
  description1: string;
  description2: string;
  description3: string;
  image: string;
  image1: string;
  image2: string;
};
 
export const products: Product[] = [
  {
    id: "1",
    name: "آلة صنع قوالب الزلابية الأوتوماتيكية",
    price: 173.00,
    image: "/Zalabia/آلة صنع قوالب الزلابية الأوتوماتيكية.png",
    image1: "/Zalabia/آلة صنع قوالب الزلابية الأوتوماتيكية 1.png",
    image2: "/Zalabia/آلة صنع قوالب الزلابية الأوتوماتيكية 2.jpg",
    description: `حوّل تجربة الطبخ في مطبخك إلى متعة حقيقية مع ماكينة صنع قوالب الزلابية المتطورة!
هذه الماكينة العملية تساعدك على تحضير الزلابية، الفطائر، السمبوسة وغيرها بسهولة، سرعة ودقة مثالية دون مجهود أو فوضى.`,
    description1: `✔️ تصميم عملي ومتين يدوم طويلاً 
✔️ تشكّل الزلابية بحجم متناسق وشكل احترافي
✔️ تختصر الوقت والجهد بشكل كبير
✔️ مناسبة للاستعمال المنزلي وحتى للمطاعم
✔️ سهلة التنظيف ولا تحتاج صيانة معقدة
✔️ آمنة وسهلة الاستخدام للجميع`,

    description2: `زلابية
سمبوسة
فطائر محشوة
معجنات بأنواعها`,

description3: `✨ وداعًا للتشكيل اليدوي المتعب
✨ نتائج متناسقة وكأنها من مطبخ محترف
✨ ماكينة واحدة… إنتاج كمية كبيرة في دقائق
✨ خيار مثالي للعائلات ومحبي الطبخ 
📦 توصيل سريع لجميع المدن
💰 الدفع عند الاستلام
🚛 توصيل مجاني إلى جميع المدن داخل ليبيا`,
  
  }
];